package edu.humberto.terriquez.actividades.proyectofinal.lang;
/**
 * Clase que contiene los mensajes del programa en japonés
 */
public class Jap extends Lang{
    public Jap(){
        menu_login = 
        "\n╔════════════════════════════╗\n" +
        "║      ログイン              ║\n" +
        "╠════════════════════════════╣\n" +
        "║ アカウントをお持ちでない方 ║\n" +
        "║ 1. 登録する                ║\n" +
        "║                            ║\n" +
        "║ アカウントをお持ちの方     ║\n" +
        "║ 2. ログインする            ║\n" +
        "║                            ║\n" +
        "║ 3. 終了                    ║\n" +
        "╚════════════════════════════╝";

menu_admin = 
        "\n╔══════════════════════════════════════════╗\n" +
        "║                 管理者メニュー              ║\n" +
        "╠════════════════════════════════════════════╣\n" +
        "║     1. 図書館に新しい本を追加する            ║\n" +
        "║     2. 貸出の状態を確認する                  ║\n" +
        "║     3. アクティブな貸出を表示する            ║\n" +
        "║     4. 登録を管理する                       ║\n" +
        "║     5. 終了                                ║\n" +
        "╚════════════════════════════════════════════╝";

menu_admin_advance = 
        "\n╔══════════════════════════════════════════════════╗\n" +
        "║                 レコード                            ║\n" +
        "╠════════════════════════════════════════════════════╣\n" +
        "║     1. 図書館に登録された人々を確認する               ║\n" +
        "║     2. 在庫の本を表示する                            ║\n" +
        "║     3. 今月のすべての貸出を表示する                   ║\n" +
        "║     4. 最もリクエストされた本のトップ                 ║\n" +
        "║     5. 最もリクエストされていない本のトップ           ║\n" +
        "║     6. 過去の貸出を表示する                          ║\n" +
        "║     7. 過去の貸出をしたユーザーを表示する             ║\n" +
        "║     8. ブラックリストを表示する                      ║\n" +
        "║     9. 名誉のリストを表示する                        ║\n" +
        "║     10. 終了                                       ║\n" +
        "╚════════════════════════════════════════════════════╝";

menu_user = 
        "\n╔══════════════════════════════════════════╗\n" +
        "║                    メニュー                 ║\n" +
        "╠════════════════════════════════════════════╣\n" +
        "║     1. 利用可能な本を表示する                ║\n" +
        "║     2. 本の貸出をリクエストする              ║\n" +
        "║     3. アクティブな貸出                     ║\n" +
        "║     4. 本を返却する                         ║\n" +
        "║     5. 終了                                ║\n" +
        "╚════════════════════════════════════════════╝";

invalid_option = 
        "\n╔═════════════════════════════════════════════════════════════╗\n" +
        "║ 無効なオプションです、メニューにない数字を入力することはできません。 ║\n" +
        "╚═══════════════════════════════════════════════════════════════╝";

username_prompt = 
        "\n╔═══════════════════════════════════╗\n" +
        "║ よろしく、ユーザー名を入力してください  ║\n" +
        "╚═════════════════════════════════════╝\n";

password_prompt = 
        "\n╔════════════════════════════╗\n" +
        "║ パスワードを入力してください    ║\n" +
        "╚══════════════════════════════╝\n";

welcome_admin = 
        "\n╔══════════════════╗\n" +
        "║  管理者へようこそ   ║\n" +
        "╚════════════════════╝";

welcome_user = 
        "\n╔═════════════════════════════╗\n" +
        "  お帰りなさい、 ";

welcome_user_format = 
        "\n" +
        "╚═════════════════════════════╝";

goodbye = 
      "\n╔═════════════╗\n" +
        "║  さようなら ║\n" +
        "╚═════════════╝";
 exit_admin_advance = 
        "\n╔═════════════════════════════╗\n" +
        "║   レコードから退出します  ║\n" +
        "╚═════════════════════════════╝";
register_user = 
      "\n╔═════════════════════════════════════════════════╗\n" +
        "║ 登録するためにユーザー名を入力してください          ║\n" +
        "╚═════════════════════════════════════════════════╝";

register_password = 
      "\n╔══════════════════════════════════╗\n" +
        "║ 安全なパスワードを入力してください  ║\n" +
        "╚══════════════════════════════════╝";

registration_success = 
      "\n╔═════════════════════════════╗\n" +
        "║ アカウントが作成されました！  ║\n" +
        "╚═════════════════════════════╝";

invalid_credentials = 
      "\n╔═══════════════════════════╗\n" +
        "║ 無効な認証情報です          ║\n" +
        "╚═══════════════════════════╝";

book_added = 
      "\n╔═══════════════════════════════════════════╗\n" +
        "║ 本は正常にカタログに追加されました！         ║\n" +
        "╚═══════════════════════════════════════════╝";

book_borrow_success = 
        "\n本が正常に貸し出されました";
book_not_available = 
        "\n本は利用できません";
invalid_input_empty = 
      "\n╔════════════════════════════════════════════════════════╗\n" +
        "║ 無効なオプションです、フィールドを空白にすることはできません ║\n" +
        "╚════════════════════════════════════════════════════════╝";

invalid_input_not_number = 
      "\n╔═══════════════════════════════════════════════╗\n" +
        "║ 無効なオプションです、番号を入力してください       ║\n" +
        "╚═══════════════════════════════════════════════╝";

invalid_option_out_of_range = 
      "\n╔═════════════════════════════════════════════════════╗n" +
        "║ 無効なオプションです、数字以外の文字を入力できます       ║\n" +
        "╚═════════════════════════════════════════════════════╝";

enter_book_title_prompt = 
      "\n╔══════════════════════════════╗\n" +
        "║ 本のタイトルを入力してください  ║\n" +
        "╚══════════════════════════════╝\n";

invalid_title = 
      "\n╔═══════════════════════════════════════════════╗\n" +
        "║ 本には名前が必要です、もう一度試してください      ║\n" +
        "╚═══════════════════════════════════════════════╝";

enter_book_author_prompt = 
      "\n╔════════════════════════════╗\n" +
        "║ 本の著者を入力してください   ║\n" +
        "╚════════════════════════════╝\n";

invalid_author = 
      "\n╔══════════════════════════════════════════════╗\n" +
        "║ 本には著者が必要です、もう一度試してください。   ║\n" +
        "╚══════════════════════════════════════════════╝";

enter_book_isbn_prompt = 
      "\n╔════════════════════════════╗\n" +
        "║ 本のISBNを入力してください   ║\n" +
        "╚════════════════════════════╝\n";

invalid_isbn = 
      "\n╔══════════════════════════════════════════════════════════╗\n" +
        "║ 本にはISBNコードが必要です、もう一度試してください。          ║\n" +
        "╚══════════════════════════════════════════════════════════╝";

enter_book_genre_prompt = 
      "\n╔══════════════════════════════╗\n" +
        "║ 本のジャンルを入力してください  ║\n" +
        "╚══════════════════════════════╝\n";

invalid_genre = 
      "\n╔══════════════════════════════════════════════════════════════════╗\n" +
        "║ 本は文学ジャンルに属する必要があります、もう一度試してください。       ║\n" +
        "╚══════════════════════════════════════════════════════════════════╝";

enter_book_year_prompt = 
      "\n╔═══════════════════════════════════════╗\n" +
        "║ 本の出版年を入力してください             ║\n" +
        "╚═══════════════════════════════════════╝\n";

year_of_publication_negative_error = 
      "\n╔═══════════════════════════════════════╗\n" +
        "║ 出版年は負の値にできません。            ║\n" +
        "╚═══════════════════════════════════════╝";

year_of_publication_future_error = 
      "\n╔══════════════════════════════════════════════════════════════╗\n" +
        "║ 出版年はまだ来ていません。2025年までの有効な年を入力してください。 ║\n" +
        "╚══════════════════════════════════════════════════════════════╝";

book_entry_success = 
      "\n╔══════════════════════════════╗\n" +
        "║ 本は利用可能として登録されます  ║\n" +
        "╚══════════════════════════════╝";

book_borrow_name_prompt = 
      "\n╔═════════════════════════════════╗\n" +
        "║ 貸し出す本のISBNを入力してください ║\n" +
        "╚═════════════════════════════════╝";

no_active_loans_message = 
      "\n╔═════════════════════════════════╗\n" +
        "║ あなたが借りた本はこちらです       ║\n" +
        "╚═════════════════════════════════╝";

no_books_borrowed_message = 
        "\n現在アクティブな貸出はありません\n";

        show_books_in_catalog_message = 
      "\n╔════════════════════════════════════════════╗\n" +
        "║ 現在の本のカタログはこちらです                ║\n" +
        "╚════════════════════════════════════════════╝";

number_format_exception = 
      "\n╔═════════════════════════════════════════╗\n" +
        "║ 数字のみ入力できます、再度試してください。  ║\n" +
        "╚═════════════════════════════════════════╝";

exit_admin = 
      "\n╔═════════════════════════════════════╗\n" +
        "║ 管理者メニューを終了します            ║\n" +
        "╚═════════════════════════════════════╝";

singning_out = 
      "\n╔═════════════════════════════════╗\n" +
        "║ アカウントのセッションを終了します ║\n" +
        "╚═════════════════════════════════╝";

return_to_menu = 
        "\nENTERキーを押してメニューに戻ります...";

invalid_new_username = 
      "\n╔═════════════════════════════════════════════════════════════════════════════╗\n" +
        "║ 有効なユーザー名を入力してください、空であってはいけません。再度試してください。    ║\n" +
        "╚═════════════════════════════════════════════════════════════════════════════╝";

invalid_new_password = 
      "\n╔══════════════════════════════════════════════╗\n" +
        "║ パスワードは空白にできません。再度試してください。║\n" +
        "╚══════════════════════════════════════════════╝";

registered_people = 
      "\n╔══════════════════════════════════════════════╗\n" +
        "║ システムに登録されている人々:                   ║\n" +
        "╚══════════════════════════════════════════════╝";

show_active_loans = 
        "\nアクティブな貸出を表示しています...";

select_an_option = 
        "\nオプションを選択してください: ";

author = 
        "著者: ";

title = 
        "タイトル: ";

isbn = 
        "ISBN: ";

genre = 
        "ジャンル: ";

year_book = 
        "出版年: ";

username = 
        "ユーザー名: ";

password = 
        "パスワード: ";

menu_lower = 
        "\n╔═════════════════════════════╗\n";

menu_upper = 
        "╚═════════════════════════════╝";

enter_age = 
        "╔══════════════════════╗\n" +
        "║ 年齢を入力してください ║\n" +
        "╚══════════════════════╝\n";

age = 
        "年齢: ";

age_negative = 
        "╔════════════════════════════╗\n" +
        "║ 年齢は負の値にできません     ║\n" +
        "╚════════════════════════════╝\n";

error_valid_number = 
        "╔════════════════════════════╗\n" +
        "║ 有効な数字を入力してください  ║\n" +
        "╚════════════════════════════╝\n";

error_real_name = 
        "╔═══════════════════════════╗\n" +
        "║ 本名を入力してください      ║\n" +
        "╚═══════════════════════════╝\n";

name_with_colon = 
        "名前: ";

error_valid_name = 
        "╔════════════════════════════╗\n" +
        "║ 有効な名前を入力してください  ║\n" +
        "╚════════════════════════════╝\n";

user_showuser = 
        "║ ユーザー:  ";

name_showuser = 
        "║ 名前:";

user_type_showuser = 
        "║ ユーザータイプ: ";

password_showuser = 
        "║ パスワード: ";

edad_showuser = 
        "║ 年齢: ";

jr_menu = 
        "╔═══════════════════════════════╗\n" +
        "║             JR メニュー        ║\n" +
        "╠═══════════════════════════════╣\n" +
        "║ 1. 利用可能な本を見る           ║\n" +
        "║ 2. 終了                       ║\n" +
        "╚═══════════════════════════════╝\n";

vip_menu = 
        "╔═══════════════════════════════════════╗\n" +
        "║               VIP メニュー             ║\n" +
        "╠═══════════════════════════════════════╣\n" +
        "║ 1. 利用可能な本を見る                   ║\n" +
        "║ 2. 本をリクエストする                   ║\n" +
        "║ 3. アクティブな貸出                     ║\n" +
        "║ 4. 本を返却する                        ║\n" +
        "║ 5. 終了                               ║\n" +
        "╚═══════════════════════════════════════╝\n";

teens_menu = 
        "╔═══════════════════════════════════════╗\n" +
        "║               ティーンズ メニュー       ║\n" +
        "╠═══════════════════════════════════════╣\n" +
        "║ 1. 利用可能な本を見る                   ║\n" +
        "║ 2. 本をリクエストする                   ║\n" +
        "║ 3. アクティブな貸出                     ║\n" +
        "║ 4. 本を返却する                         ║\n" +
        "║ 5. 終了                                ║\n" +
        "╚═══════════════════════════════════════╝\n";

error_same_unique_code = 
        "╔══════════════════════════════════════════════════════════╗\n" +
        "║ 同じユニークコードの本がすでに存在するため、追加できません。  ║\n" +
        "╚══════════════════════════════════════════════════════════╝\n";

update_loans = 
        "╔═══════════════════════════════════╗\n" +
        "║ 貸出が更新されました                ║\n" +
        "╚═══════════════════════════════════╝\n";

borrowed_success = 
        "╔══════════════════════════════╗\n" +
        "║ 貸出が正常に完了しました       ║\n" +
        "╚══════════════════════════════╝\n";

adult_borrowed = 
        "╔══════════════════════════════════════════════════════════════════════════════╗\n" +
        "║ 本は7日間借りられました、大人のユーザーとして時間内に返却してください。             ║\n" +
        "╚══════════════════════════════════════════════════════════════════════════════╝\n";

enter_isbn = 
        "╔══════════════════════════════════════════════╗\n" +
        "║ 返却する本のISBNを入力してください              ║\n" +
        "╚══════════════════════════════════════════════╝\n";

entered_invalid_isbn = 
        "╔════════════════════════════╗\n" +
        "║ 有効なISBNを入力してください ║\n" +
        "╚════════════════════════════╝\n";

teen_borrowed = 
        "╔═════════════════════════════════════════════════════════════════════════════╗\n" +
        "║ 本は7日間借りられました、ティーンユーザーとして時間内に返却してください。          ║\n" +
        "╚═════════════════════════════════════════════════════════════════════════════╝\n";

vip_borrowed = 
        "╔═══════════════════════════════════════════════════════════════════════════╗\n" +
        "║ 本は14日間借りられました、VIPユーザーとして時間内に返却してください。           ║\n" +
        "╚═══════════════════════════════════════════════════════════════════════════╝\n";
        fantasy = 
        "ファンタジー";

got = 
        "ゲーム・オブ・スローンズ";

lotr = 
        "指輪物語";

hp = 
        "ハリー・ポッター";

tlp = 
        "星の王子さま";

ohyos = 
        "百年の孤独";

dqolm = 
        "ドン・キホーテ";

ta = 
        "アルケミスト";

tvdc = 
        "ダ・ヴィンチ・コード";

tp = 
        "香水";

tsotw = 
        "風の影";

ttob = 
        "本泥棒";

error_modifing_date = 
        "期限処理エラー: ";

user_and_book_not_found = 
        "╔═══════════════════════════════════════════════════════════════╗\n" +
        "║ この本とユーザーにはアクティブな貸出が見つかりませんでした。        ║\n" +
        "╚═══════════════════════════════════════════════════════════════╝\n";

overdue_loans = 
        "延滞貸出: ";

book_alone = 
        "本: ";

isbn_overdue_loans = 
        "║ ISBN: ";

user_overdue_loans = 
        "║ ユーザー: ";

return_date_overdue_loans = 
        "║ 返却日: ";

error_comparing_dates = 
        "日付の比較エラー: ";

no_overdue_loans = 
        "╔════════════════════════════════════════════╗\n" +
        "║ 延滞貸出はありません。                       ║\n" +
        "╚════════════════════════════════════════════╝\n";

error_already_exists = 
        "╔══════════════════════════════v═════╗\n" +
        "║ エラー: ユーザーはすでに存在します。  ║\n" +
        "╚═══════════════════════════════════╝\n";

user_not_found = 
        "╔═══════════════════════════════════╗\n" +
        "║ エラー: ユーザーが見つかりません。   ║\n" +
        "╚═══════════════════════════════════╝\n";

book_not_found = 
        "╔════════════════════════════════╗\n" +
        "║ エラー: 本が見つかりません。      ║\n" +
        "╚════════════════════════════════╝\n";

book_not_available = 
        "╔════════════════════════════════╗\n" +
        "║ エラー: 本は利用できません。     ║\n" +
        "╚════════════════════════════════╝\n";

return_date = 
        "╔═══════════════════════╗\n" +
        "║ 返却日:               ║\n" +
        "╚═══════════════════════╝\n";

no_overdue_loans = 
        "╔════════════════════════════════════════════╗\n" +
        "║ 延滞貸出は図書館にありません。               ║\n" +
        "╚════════════════════════════════════════════╝\n";

with_the_book = 
        "╔══════════════════╗\n" +
        "║ 本を持っています  ║\n" +
        "╚══════════════════╝\n";

overload_teens = 
        "╔══════════════════════════════════════════════════════════════════════════╗\n" +
        "║ 一度に1冊しか本を借りられません。返却してから別の本を借りてください。          ║\n" +
        "╚══════════════════════════════════════════════════════════════════════════╝\n";

overload_adult = 
        "╔═════════════════════════════════════════════════════════════════════════════╗\n" +
        "║ 一度に2冊まで本を借りられます。返却してから別の本を借りてください。               ║\n" +
        "╚═════════════════════════════════════════════════════════════════════════════╝\n";

overload_vip = 
        "╔═════════════════════════════════════════════════════════════════════════════╗\n" +
        "║ 一度に5冊まで本を借りられます。返却してから別の本を借りてください。               ║\n" +
        "╚═════════════════════════════════════════════════════════════════════════════╝\n";

error_saving_loans = 
        "貸出の保存エラー: ";

loans_data_not_found = 
        "╔═════════════════════════════════════════╗\n" +
        "║ 貸出データが見つかりません。               ║\n" +
        "╚═════════════════════════════════════════╝\n";

error_saving_user = 
        "ユーザーの保存エラー: ";

user_data_not_found = 
        "╔══════════════════════════════════════════╗\n" +
        "║ ユーザーデータが見つかりません。            ║\n" +
        "╚══════════════════════════════════════════╝\n";

error_loading_user = 
        "╔═════════════════════════════╗\n" +
        "║ ユーザーの読み込みエラー      ║\n" +
        "╚═════════════════════════════╝\n";

error_saving_books = 
        "本の保存エラー: ";

book_data_not_found = 
        "╔══════════════════════════════════════╗\n" +
        "║ 本のデータが見つかりません。            ║\n" +
        "╚══════════════════════════════════════╝\n";

error_loading_books = 
        "╔═════════════════════════════╗\n" +
        "║ 本の読み込みエラー            ║\n" +
        "╚═════════════════════════════╝\n";

succesfuly_returned = 
        "╔═══════════════════════════╗\n" +
        "║ 本は正常に返却されました    ║\n" +
        "╚═══════════════════════════╝\n";

book_not_borrowed = 
        "╔════════════════════════════════════════╗\n" +
        "║ エラー: この本は借りていません。          ║\n" +
        "╚════════════════════════════════════════╝\n";

users_with_overdue = 
        "延滞している貸出のあるユーザー: ";

no_users_with_overdue = 
        "╔══════════════════════════════════════════╗\n" +
        "║ 延滞貸出があるユーザーはいません。          ║\n" +
        "╚══════════════════════════════════════════╝\n";

user_more_returned = 
        "ユーザー: ";

book_more_overdue = 
        "║ 本: ";

name_more_returned = 
        "║ 名前: ";

type_more_returned = 
        "║ タイプ: ";

overdue_loans_more_overdue = 
        "║ 延滞貸出: ";

users_with_more_returns = 
        "最も多く本を返却したユーザー: ";

no_users_with_returns = 
        "╔══════════════════════════════════════════╗\n" +
        "║ 返却した本があるユーザーはいません。        ║\n" +
        "╚══════════════════════════════════════════╝\n";

returned_loans = 
        "║ 返却された貸出: ";

books_arranged_by_title = 
        "タイトル順に並べられた本: ";

currently_available = 
        "現在利用可能";

currently_borrowed = 
        "現在貸出中";

available_books_arranged_by_title = 
        "タイトル順に並べられた利用可能な本: ";

no_books_available_on_library = 
        "╔═══════════════════════════════════╗\n" +
        "║ 図書館には利用可能な本がありません。 ║\n" +
        "╚═══════════════════════════════════╝\n";

popular_books = 
        "最も人気のある本: ";

no_popular_books = 
        "╔═══════════════════════════════════╗\n" +
        "║ 図書館には人気のある本がありません。 ║\n" +
        "╚═══════════════════════════════════╝\n";

title_more_popular = 
        "タイトル: ";

author_more_popular = 
        "║ 著者: ";

times_more_popular = 
        "║ 借りられた回数: ";

unpopular_books = 
        "最も人気のない本: ";

no_books_on_library = 
        "╔═══════════════════════════╗\n" +
        "║ 図書館には本がありません。  ║\n" +
        "╚═══════════════════════════╝\n";

loans_of_month = 
        "今月の貸出: ";

borrow_date_admin_loans = 
        "║ 貸出日: ";

no_loans_on_month = 
        "╔═════════════════════════════════════════╗\n" +
        "║ 今月、図書館で記録された貸出はありません。  ║\n" +
        "╚═════════════════════════════════════════╝\n";

active_loans = 
        "アクティブな貸出: ";

no_active_loans = 
        "╔═══════════════════════════════════════════╗\n" +
        "║ 図書館にアクティブな貸出はありません。       ║\n" +
        "╚═══════════════════════════════════════════╝\n";

active_loans_of = 
        "アクティブな貸出: ";

asset_loans = 
        "╔═════════════════════════════════════════════╗\n" +
        "║ あなたは現在、アクティブな貸出はありません。    ║\n" +
        "╚═════════════════════════════════════════════╝\n";

error_book_already_registered = 
        "╔═══════════════════════════════════════════╗\n" +
        "║ エラー: 本はすでに登録されています。         ║\n" +
        "╚═══════════════════════════════════════════╝\n";
users_with_more_overdue = 
        "延滞貸出が多いユーザー:  ";


    }
}